<?php

namespace App\Livewire\AcademicLeave;

use Livewire\Component;

class PersonalRecordsCheckSheet extends Component
{
    public $user_id;
    public $group_id;

    public $listDocumentsVerification = [
        'Внутренняя опись документов' => '',
        'Расписка' => '',
        'Заявление о приеме' => '',
        'Выписки из приказов (зачисление, переводы на последующий курс, отчисление, иные)' => '',
        'Заявление на регистрацию в ЭБС' => '',
        'Лист ознакомления с ЛНА' => '',
        'Согласие на обработку персональных данных обучающегося, заказчика, законного представителя (для несовершеннолетнего обучающегося)' => '',
        'Согласие на зачисление (если необходимо)' => '',
        'Документ о предыдущем образовании (квалификации): оригинал' => '',
        'Документ о предыдущем образовании (квалификации): копия' => '',
        'Документ, удостоверяющий личность (копия)' => '',
        'Справка ЕГЭ/ протокол вступительных испытаний (для программ ВО)' => '',
        'Договор и дополнительные соглашения (ежегодные и иные)' => '',
        'СНИЛС (копия)' => '',
        'Копия диплома о профессиональной переподготовке (для групп, обучающихся по индивидуальному учебному плану ускоренно)' => '',
    ];

    public $listDocumentsVerificationForeigner = [
        'Нотариально заверенный перевод документа, удостоверяющего личность и документа об образовании (квалификации) (оригинал)' => '',
        'Свидетельство о признании документа об образовании (квалификации) (оригинал) (при необходимости процедуры нострификации)' => '',
        'Миграционная карта (копия)' => '',
        'Регистрация по месту жительства (копия)' => '',
        'Полис ДМС или уведомление о необходимости его получения с подписью иностранного гражданина ' => '',
        'Информация о прохождении дактилоскопической регистрации или уведомление о необходимости ее получения с подписью иностранного гражданина' => '',
        'Учебная виза (копия)' => '',
    ];

    public function mount($user_id, $group_id)
    {
        $this->user_id = $user_id;
        $this->group_id = $group_id;
    }
    
    public function render()
    {
        return view('livewire.academic-leave.personal-records-check-sheet');
    }
}
